# ClosedProfileRoof Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ClosedProfileRoof Property
BuiltInFailures..::..SketchFailures Class See Also
---
Extrusion roof sketch must be open. The roof's thickness and material composition are defined in its type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ClosedProfileRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClosedProfileRoof As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ClosedProfileRoof {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace